BAS BMEKZU Project/src/Catalogs/ИНАГРО_ВидыКультур/ИНАГРО_ВидыКультур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИНАГРО_ВидыКультур</name>
  <attributes>
    <name>ВидКультурыДляРасчетаСтоимостиУслуги</name>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыКультурДляРасчетаСтоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКультурыДляРасчетаУбыли</name>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыКультурДляРасчетаУбыли</types>
    </type>
  </attributes>
  <attributes>
    <name>ГОСТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДиаметрСита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентНавеса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НегодныеОтходы</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПобочныйПродукт</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечаниеКСвидетельству</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитыватьХранение</name>
    <comment>Рассчитывать хранение</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтепеньВлажности</name>
    <type>
      <types>EnumRef.ИНАГРО_СтепеньВлажности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтепеньЗагрязнения</name>
    <type>
      <types>EnumRef.ИНАГРО_СтепеньЗагрязнения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтепеньЗараженности</name>
    <type>
      <types>EnumRef.ИНАГРО_СтепеньЗараженности</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьБазисВлажность</name>
    <comment>Базис влажность</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьБазисЗерноваяПримесь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьБазисСорнаяПримесь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВлажностьДляРасчетаУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗерноваяПримесьДляРасчетаУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСорнаяПримесьДляРасчетаУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыХарактеристик</name>
    <attributes>
      <name>ВидХарактеристики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ИНАГРО_ХарактеристикиВидовКультур</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>DRU_КодХарактеристикиСкладскойКвитанции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DRU_КодХарактеристикиСкладскогоСвидетельства</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DRU_ТипХарактеристики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтображениеВОперативнойИнформацииПоКачеству</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьЗначениеХарактеристики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ИНАГРО_ХарактеристикиВидовКультур</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыХарактеристикПроценты</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ИНАГРО_ХарактеристикиВидовКультур</types>
      </type>
    </attributes>
    <attributes>
      <name>процент1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>процент2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>процент3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>процент4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_МасличныеКультуры/ИНАГРО_МасличныеКультуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_МасличныеКультуры</name>
  <resources>
    <name>МасличноеЗерно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидКультуры</name>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыКультур</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Catalogs/ИНАГРО_ВидыКультур/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.ВидыХарактеристик.Количество()> 0 Тогда
		ТекстВопроса = НСтр("ru='Табличная часть будет очищена. Продолжить?';uk='Таблична частина буде очищена. Продовжити?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);  
	Иначе
		ЗаполнитьПоУмолчанию(); 
	КонецЕсли; 	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
   	
    Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда 		
		Возврат;
	КонецЕсли;
	
	Объект.ВидыХарактеристик.Очистить();  	
	
	ЗаполнитьПоУмолчанию(); 
			
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию()
	 	
	МакетПодбора = ПолучитьМакет();
	
	СписокОбластей = Новый СписокЗначений;

	Для Каждого Область Из МакетПодбора.Области Цикл
		СписокОбластей.Добавить(Область.Имя);
	КонецЦикла;
	
	Для Каждого Строка Из СписокОбластей Цикл
		Строка.Представление = ПолучитьПредставлениеИмени(Строка.Значение);
	КонецЦикла;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МакетПодбора", МакетПодбора);	
			
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПоУмолчаниюПродолжение", ЭтотОбъект, ДополнительныеПараметры); 
	
	СписокОбластей.ПоказатьВыборЭлемента(Оповещение, НСтр("ru='Выберите культуру';uk='Виберіть культуру'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчаниюПродолжение(ЭлементПодбора, ДополнительныеПараметры) Экспорт
	
	Если ЭлементПодбора = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	Подбор = Новый Структура;
	Подбор.Вставить("МакетПодбора",           ДополнительныеПараметры.МакетПодбора);
	Подбор.Вставить("ЗначениеЭлементПодбора", ЭлементПодбора.Значение);
	
	ЗаполнитьХарактеристики(Подбор);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВидыХарактеристикВидХарактеристикиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВидыХарактеристик.ТекущиеДанные;
	
	ДанныеСтрокиТаблицы = Новый Структура("ВидХарактеристики, ЕдиницаИзмерения");
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, ТекущиеДанные);

	ВидыХарактеристикВидХарактеристикиПриИзмененииНаСервере(ДанныеСтрокиТаблицы);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеСтрокиТаблицы);	

КонецПроцедуры

&НаСервере
Функция ПолучитьМакет()
	
	МакетПодбора = Справочники.ИНАГРО_ВидыКультур.ПолучитьМакет("КлассификаторЭлемента");

	Возврат МакетПодбора;

КонецФункции

&НаКлиенте
Функция ПолучитьПредставлениеИмени(Имя)
	
	Представление = СтрЗаменить(Имя, "_", " ");
	
	Возврат Представление;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьХарактеристики(Подбор)
	
	МакетПодбора   = Подбор.МакетПодбора;	
	ОбластьПодбора = МакетПодбора.Область(Подбор.ЗначениеЭлементПодбора);
	
	Для НомерСтроки = ОбластьПодбора.Верх По ОбластьПодбора.Низ  Цикл
		
		Для НомерКолонки = ОбластьПодбора.Лево По ОбластьПодбора.Право Цикл
			
			Ячейка = МакетПодбора.Область("R" + Строка(НомерСтроки) + "|C" + Строка(НомерКолонки + 1));
			
			Если Ячейка.Текст = "" Тогда 
				Продолжить;
			КонецЕсли;
			
			Попытка
				ВидХарактеристики = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур[Ячейка.Текст];
				НоваяСтрока = Объект.ВидыХарактеристик.Добавить();
				НоваяСтрока.ВидХарактеристики = ВидХарактеристики;
			Исключение
				ТекстСообщения = НСтр("ru='Элемент %1 не найден';uk='Елемент %1 не знайдено'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,Ячейка.Текст));
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если РегистрыСведений.ИНАГРО_МасличныеКультуры.Получить(Новый Структура("ВидКультуры", Объект.Ссылка)).МасличноеЗерно Тогда
		НоваяСтрока = Объект.ВидыХарактеристик.Добавить();
		НоваяСтрока.ВидХарактеристики = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Масличность;
	КонецЕсли;
	
	ЗаполнитьЕдиницаИзмерения();
	
Конецпроцедуры

&НаСервере
Процедура ЗаполнитьЕдиницаИзмерения()
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.ВидыХарактеристик Цикл
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.ВидХарактеристики.ЕдиницаИзмерения;		
	КонецЦикла;
	
КонецПроцедуры

#Область ОбработчикиСобытийТаблицФормы

&НаСервереБезКонтекста
Процедура ВидыХарактеристикВидХарактеристикиПриИзмененииНаСервере(СтрокаТабличнойЧасти)
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.ВидХарактеристики.ЕдиницаИзмерения;
	
КонецПроцедуры 
 
#КонецОбласти

#КонецОбласти
